In [2]:
import pandas as pd

In [3]:
data={'author_id':[1,2,3],'author_name':['Тургенев','Чехов','Островский']}

In [4]:
authors=pd.DataFrame(data)

In [5]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [6]:
data2={'author_id':[1,1,1,2,2,3,3],
       'book_title':['Отцы и дети','Рудин','Дворянское гнездо',
                     'Толстый и тонкий','Дама с собачкой','Гроза',
                     'Таланты и поклонники'],
       'price':[450,300,350,500,450,370,290]}

In [7]:
book=pd.DataFrame(data2)

In [8]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

In [9]:
authors_price=pd.merge(authors, book, on='author_id', how='inner')

In [10]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [11]:
authors_price_sort=authors_price.sort_values(by='price')

In [12]:
authors_price_sort

   author_id author_name            book_title  price
6          3  Островский  Таланты и поклонники    290
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
5          3  Островский                 Гроза    370
0          1    Тургенев           Отцы и дети    450
4          2       Чехов       Дама с собачкой    450
3          2       Чехов      Толстый и тонкий    500

In [13]:
top5=authors_price_sort.sort_values(by='price', ascending=False)

In [14]:
top5=top5.head(5)

In [15]:
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

In [16]:
group_by = authors_price.groupby("author_name")

In [17]:
groupby

NameError: name 'groupby' is not defined

In [ ]:
authors_stat=authors_price.groupby(['author_name']).agg({'price': ['mean', 'min', 'max']}).round(2)

In [ ]:
authors_stat

In [18]:
authors_price = pd.concat([authors_price, df3], axis=1)

NameError: name 'df3' is not defined

In [19]:
df3 = pd.DataFrame(
    {'cover': ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']}
)
df3

     cover
0  твердая
1   мягкая
2   мягкая
3  твердая
4  твердая
5   мягкая
6   мягкая

In [20]:
authors_price = pd.concat([authors_price, df3], axis=1)

In [21]:
authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [23]:
book_info=authors_price.pivot_table('price', index='author_name', columns='cover')

book_info

In [25]:
book_info["мягкая"].fillna(0, inplace=True)

In [26]:
book_info

cover        мягкая  твердая
author_name
Островский    330.0      NaN
Тургенев      325.0    450.0
Чехов           0.0    475.0

In [27]:
book_info["твердая"].fillna(0, inplace=True)

In [28]:
book_info

cover        мягкая  твердая
author_name
Островский    330.0      0.0
Тургенев      325.0    450.0
Чехов           0.0    475.0

In [30]:
import pickle

In [31]:
book_info.to_pickle('book_info.pkl')

In [32]:
book_info2=pd.read_pickle('book_info.pkl')

In [34]:
book_info2

cover        мягкая  твердая
author_name
Островский    330.0      0.0
Тургенев      325.0    450.0
Чехов           0.0    475.0